InformationRegisters/ЛьготыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЛьготыКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛьготыКлиентов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвразает массив льгот клиента
//
// Параметры:
//  Клиент	 - СправочникСсылка.Клиенты	 - Клиент
// 
// Возвращаемое значение:
//  Массив - Массив льгот клиента
//
Функция ПолучитьЛьготыКлиента(Клиент) Экспорт

	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛьготыКлиентов.Льгота КАК Льгота
		|ИЗ
		|	РегистрСведений.ЛьготыКлиентов КАК ЛьготыКлиентов
		|ГДЕ
		|	ЛьготыКлиентов.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Льгота");
	
КонецФункции

#КонецОбласти
